[
  {
    "number": 1,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00074_CSL00074_001/full/800,/0/default.jpg",
    "title": "Origins",
    "content": "<p>The Chicano Studies Library was an outgrowth of the Chicano Movement. The Chicano Movement, also referred to as El Movimiento, was a social and political movement. The Library’s founding is rooted in the Third World Liberation Front (TWLF) Strike that took place on the UC Berkeley campus in 1969. The TWLF was a coalition of African American, Native American, Mexican American, and Asian American groups. During the strike, students demanded that the university confront racism on campus and create a Third World College; a separate college with ethnic studies departments and its own dean. They called on the university to actively recruit and maintain faculty, staff and students from marginalized groups. Amidst extreme police violence and institutional pressures, the students held their ground. After 10 weeks, the strike ended. While a separate Third World College was not realized, a Department of Ethnic Studies was created. The Mexican American Student Confederation (MASC) was a key organizer of the Third World Liberation Front. Throughout the strike MASC anticipated and planned for the establishment of a fully functioning Chicanx library. In 1969, the Associated Students of the University of California (ASUC) approved a student fee to provide funding for the 4 newly formed programs within the Ethnic Studies Department. Chicano Studies Program Coordinator, Myrtha Chabrán directed a portion of these funds to develop the library. Initially known as La Raza library, the Chicano Studies Library was never just a place to conduct research and collect Chicanx materials. It was a tool for social justice that was made possible by and for communities on and off campus. The objective was not only to found and organize a library, but to bring people together to make concrete change.</p>"
  },
  {
    "number": 2,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00080_CSL00080_001/full/800,/0/default.jpg",
    "title": "A Chicano Studies Library",
    "content": "<p>In the 1960s Chicanx students did not see themselves in the Berkeley libraries despite the fact that Berkeley was regarded as one of the finest libraries in the nation. In their classrooms and in the publications they read, their culture and experience were summed up as problems: for example, the problem of migrant labor or the problem of Spanish speaking children in schools.  Collecting materials to counter that perspective was essential. Students, with support from the emerging Chicano Studies Program developed a Chicano Studies library. The new library was located in a small room in Dwinelle Hall and was initially composed of a few bookshelves and file cabinets that contained student papers, local community bulletins, and ephemera. Students brought in materials they collected from community events and would hang out in this space, talking, making plans and studying.</p><p>Professor Oswaldo Asturias was the first coordinator of La Raza Studies at UC Berkeley.  Asturias asked author Lucha Corpi, who was a work study student at the time, to devote part of her working hours to identifying and obtaining books for the library. According to an early departmental organizational chart, Corpi became the library’s first official coordinator in 1971. As the collection grew and became more well known on campus, students began to apply to work at the library.  Student workers welcomed library visitors at a small desk and helped them locate materials while also working on specific tasks such as compiling bibliographies, assisting with collection development, materials processing and searching for relevant materials across the Berkeley libraries system. In 1972, architecture and urban planning student Jose Antonio Arce became the coordinator of the library. Arce was the first dedicated library staff member and played a major role in building the collections and shaping how materials would be classified. Arce worked closely with student worker John Gonzales who developed and organized the fledgling serial collection into a nationally known and sought after collection.  The first official archivist of the Chicano Studies Program, Gonzales documented the early history of the department and also compiled several published bibliographies and a typology of the serial collection.</p><p>In 1973, anthropology student Richard Chabrán began working at the library after Arce suggested he join their team. Chabrán was tasked with caring for the serials collection. Chabrán remembers that “This [work] was really important for me because I came to realize that those newspapers represented the voices of communities across the country that you don't often hear or read about. They were an education for me.” Chabrán originally intended to become an anthropologist, however he was drawn into librarianship while working under Arce at the Chicano Studies Library. Chabrán explains that working at the library “was an opportunity to acknowledge that I had not learned the history of my people the way I thought it should be taught. [It was] an opportunity to develop that history, and to develop those resources, so that not  just my community, but the world would know it. That was a big inspiration for me. I wanted to become a librarian, but it was with a very particular purpose.” Chabrán obtained his masters degree in library science and information studies and became the library’s coordinator in 1975. During his time at the library, Chábran led many pivotal projects that put the Chicano Studies Library on the map as one of the nation’s leading Chicanx collections. In recognition of his work and the growing significance of the library, faculty from the Chicano Studies Department successfully petitioned the university administration to formalize and finally officially recognize the coordinator position as being within the librarian series in 1977. When Chabrán left the library in 1979, librarians Francisco García-Ayvens (coordinator from 1980-1984) and Lillian Castillo-Speed (coordinator from 1984- 1992, Head of the Ethnic Studies library and Chicano Studies Librarian from 1992-today) built on the work that others started.</p><p>Throughout the 70s and 80s, the library continued to grow, housing materials and cultivating programs that were unavailable elsewhere. The Chicano Studies Library staff and faculty collected posters, ephemera and bulletins- materials that were important to their community but not always valued by other kinds of libraries, museums or galleries. Library staff were not limited by or concerned with previous conceptions of what a library should be. The entire library represented a world that was missing in other libraries and on campus. Staff were empowered to act on behalf of wider communities as part of a collective struggle.</p>"
  },
  {
    "number": 3,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00002_CSL00002_001/full/800,/0/default.jpg",
    "title": "Labels & Systems:<br>We Built Our Own",
    "content": "<p>Early library staff were mostly work study students without backgrounds in library science or experience running a library. However, they quickly understood that standardized library descriptive, classification and access systems weren’t going to work for their growing collection or communities.  They needed their own intellectual infrastructure for information retrieval. All of the resources they worked hard to collect would mean little if they could be found only through a racist or stereotyped framework.</p><p>Jose Antonio Arce is credited with having conceived of the Chicano Classification System, a modification of the Library of Congress Classification system that aimed to center a Chicanx worldview. Arce consulted with librarians in the main Berkeley library system in order to devise a way to organize the Chicano Studies Library and collaborated with student workers such as Elva Yañez to realize his vision. In 1974 he released the Chicano Classification system. The Chicano Classification System is an important part of the story of the library itself and is used to organize the Chicano Studies Collection within the Ethnic Studies Library today.</p><p>The Chicano Movement of the late 60s and 70s produced an explosion of political, literary, artistic, and intellectual literature. Chicanx librarians desperately needed an index so that they could point students to articles for research, affirmation of their identities or political organizing. Mainstream reference tools did not include or even acknowledge Chicanx literature. This exclusion perpetuated the falsehood that there was no history of Chicano literature. In 1978, the Chicano Periodical Indexing Project brought together a group of fourteen librarians across seven institutions. They indexed 18 periodicals, among which were Agenda, Atisbos, Aztlán, Caracol, Chicano Law Review, Con Safos, De Colores, Encuentro, El Grito, Grito del Sol, Journal of Mexican American History, The Journal of Mexican American Studies and Somos. The first Chicano Periodical Index was produced using an outside company’s computer system. Soon afterwards, García-Ayvens purchased an AlphaMicro computing system to bring the entire process within the control of library staff. The first edition of the Chicano Periodical Index (CPI) was published in 1981 by G.K. Hall. The thick, beautifully bound green volume included 24,000 entries and is the manifestation of many hours, hands and hearts that devoted their time as volunteers to bring the index to life.</p><p>As plans for the Chicano Periodical Index developed, it became clear that a dedicated set of controlled terms was needed to describe the contents of the articles. The Library of Congress Subject Headings (LCSH), a standardized list of terms that libraries are required to use included terms such as “Illegal Aliens,” that were demeaning as well as inaccurate. The LCSH also lacked specific terms for concepts that were part of the Chicanx worldview. Understandably, some of those concepts are best expressed in Spanish.  The Chicano Thesaurus is a refusal to accept the unacceptable. The project to create the Chicano Thesaurus ran in parallel to the creation of the Chicano Periodical Index and was first published in 1979.</p><p>In 1984, Lillian Castillo-Speed became Coordinator of the Chicano Studies Library. Castillo-Speed continued to develop the Chicano Periodical Index and Chicano Thesaurus in collaboration with Chabrán and García-Ayvens who continued to contribute to these projects after leaving the Chicano Studies Library. Working as a team, Castillo-Speed led these projects through many technological transitions. She first moved the projects away from an outdated BASIC system and then worked closely with programmers to migrate the index and thesaurus to CD-Rom, Windows based systems and later to an open-source web content management system to create the Chicano Database, now available online. The Chicano Thesaurus was officially added to the Library of Congress’ list of approved alternative terms in 1990, making it easier for other libraries to use Chicano Thesaurus terms.</p><p>The library also created its own publishing unit. Since the main UC library system did not list the CSL’s holdings in its catalog, the CSL made a practice of publishing a list of recent additions to their collections in order to enhance discovery of its collections In a move that would prove key to the unit’s later success, early library staff had the foresight to microfilm the library’s unique collection of Chicano newspapers.  As other libraries began collecting Chicanx materials, the newspapers were in demand but often no longer available. The Chicano Studies Library was able to meet the needs of other libraries by selling a collection of the microfilmed newspapers. The funds generated from these sales enabled the library to expand its publishing unit and pursue publishing projects such as the The Chicano Anthology Index, the Bibliography of Writings on La Mujer, the Chicana Studies Index,  and Arte Chicano. Each of these publications was the first of its kind. They could only be created with the Chicano Studies Library’s collections, its reputation among scholars, and the fact that it had its own funding to pay for printing costs. The Publications Unit team of the 1980s was small but highly talented. Publications Coordinator Carolyn Soto brought her design expertise, while then Coordinator and Publications Editor Francisco García-Ayvens brought his sharp editorial eye. When G.K. Hall discontinued publishing the index as soon as it failed to generate revenue, the library took over and continued to publish the print editions, the CD-ROM versions and to license the Chicano Database.</p><p>The Chicano Studies Library overcame the practices of mainstream librarianship and the mainstream publishing industry to meet the needs of its communities.</p>"
  },
  {
    "number": 4,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00025_CSL00025_001/full/800,/0/default.jpg",
    "title": "Library as Place",
    "content": "<p>The library exists as a universe in which Chicanx and wider Latinx communities are seen, heard and empowered to change and create new narratives.  Chicanx students built the Chicano Studies Library in support of their own communities. Students, activists, and academics partnered with library workers and even became library workers themselves to keep the library going. The Chicano Studies Library contained one of the first Chicanx collections in the United States. Part of its mission was to preserve and make Chicanx knowledge available into the future. Former Director of the Office for Diversity of the American Library Association Sandra Rios Balderrama conveyed the sentiment of many other student workers when she described her work at the library as sacred work. “I say it's sacred work because it's our stories…those books, those materials, those posters, they reflect the spirit of our ancestors.” The students felt a connection to the library that went beyond its walls or any materials housed within it. Besides creating a library, they were creating a kind of home.</p><p>The library was never just a place for research, but also a safe space for Latinx students who sometimes felt alone on an overwhelmingly white campus. Former student worker Chela Rios Muñoz remembers “When I came to Berkeley, there were few Chicano or Latino students…Entering campus, it was just a feeling of “Do I belong here?” A feeling of being lost and not necessarily embraced. Going to the Chicano Studies Library, walking in and being with other Chicanos and Latinos and seeing collections that I had never seen before, and feeling accepted and embraced and respected, really made a difference for me…” In the Chicano Studies Library, Latinx students finally had a place on campus where they felt safe. For many, it was the first time they would enter a library built for them, full of materials and stories focused on Chicanx histories through their eyes. In the library they saw posters, artwork and newspapers proudly on display that communicated issues and ideas they cared about. Rios Muñoz asked  “Where else would you go on campus where you could see some kind of reflection of yourself? Rios Balderrama echoed Rios’ sentiments. When sharing her memories of working in the library, she recalled that “It was primarily a library, but it was also a place that we could gather, that we knew that was safe. It was a place that affirmed us. This was a huge influence on me; the fact that a library that was devoted and committed to preserving and disseminating the story of Chicanos. The fact that this type of library existed was so unusual. It was a place where through the books, through the displays, we were seen.”</p><p>One of many communities that found a home in the library was Latinx women. While women made many contributions to the struggle for social justice on campus and in the community, they were often excluded or expected to stay at home with family. In the tradition of the library, women came together there and created a space for themselves. Former student workers remember having a key and opening the library in the evenings to hold meetings with other women.They created all women activist groups, such as Mujeres del Movimiento. Purita Mesa, a former student worker at the library, remembers being part of this group: “I think we did Mujeres del Movimiento because there was a women's movement going on at the same time. We were pretty powerful and smart and we wanted to establish ourselves. Some of the men on campus didn't see us that way and I think that was the impetus…to do things on our own…Not only did we pursue intellectual things, and help the community, but we were really intimate with each other as women. It was so important to separate ourselves and be alone and spend that time together.” Chabrán and other library staff acknowledged that womens’ voices were missing in the on the campus.  They supported efforts to address these absences and provided important avenues for expression and affirmation. The library sponsored the Educación En Luz Symposium, an interdisciplinary gathering produced by Mujeres del Movimiento. The symposium was an opportunity for Latinx women scholars to share ideas and connect and featured Chicana authors Anna Nieto-Gómez and Concha Salcedo. Another project that developed out of Chicanas having space in the library was the Bibliography of Writings on la Mujer. The library and its publication unit supported this effort and published the Bibliography of writings on la Mujer in 1976, the first bibliography of its kind. Rios Baldarrama remembers that after completing A Comprehensive Bibliography on La Chicana, an unpublished revision of the Bibliography of writings on la Mujer, a male coworker asked why the bibliography didn’t contain a section on La Familia. Rios Baldarrama explained that the women behind the project wanted to focus on other things that mattered to them like Chicana lesbianism and Chicana labor.  The library cultivated an environment where young women working on projects in the library felt empowered to complete them on their own terms.</p><p>In addition to creating space for student organizing and social gatherings, the library also fostered unique cultural programs. The library hosted events featuring important voices from the Chicanx community such as activist Ernesto Galarza and brought Aspectos de la Literatura Chicana, an exhibition of Chicanx Literature to Berkeley’s main library. The Chicano Studies Library purchased and collected art from local artists and also provided a venue for them. Artist Malaquías Montoya remembers that when asked whether he had a gallery to represent his work he would reply “Oh, of course I do. I said, I have a library that  shows my work all year round.  And they [professors and curators] all got real interested.” The library created not only a place, but a platform for celebrating Chicanx culture and heritage that uplifted the community for everyone to see.</p>"
  },
  {
    "number": 5,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00019_CSL00019_001/full/800,/0/default.jpg",
    "title": "Ethnic Studies Library Transition",
    "content": "<p>In 1969, the Associated Students of the University of California (ASUC) at Berkeley instituted a student fee to support the new programs that made up the Ethnic Studies Department.  Historically, each program gave the majority of those funds to maintain its own small library. From the 1970s to the early 1990s, The Chicano Studies Library, the Asian American Studies Library, and the Native American Studies Library occupied spaces in Wheeler Hall. In the early 90s, the university administration asked the Ethnic Studies Department to consider moving the three libraries to Stephens Hall in order to create more classroom space in Wheeler Hall.</p><p>The three library teams met to discuss how the new space in Stephens Hall could be used. The libraries had long been in need of additional space. They came to an agreement that each library would be transformed into a distinctive collection within a larger single library structure; The Chicano Studies Collection, the Asian American Studies Collection and the Native American Studies Collection. A fourth collection was also established: the Comparative Ethnic Studies Collection. From the beginning, it was important to maintain the separate identities and histories of each former library. All staff members were retained with each formerly independent librarian now in charge of their own collection.  While the libraries were not allocated as much library space as they initially hoped for, additional on campus storage space allowed for equal space provision between each of the collections and room for them to grow. Then Ethnic Studies Chair, Elaine Kim, decided the name of the combined libraries would be “The Ethnic Studies Library.” Lillian Castillo-Speed became Head Librarian of the Ethnic Studies Library and on July 18th, 1997, with speeches from the Ethnic Studies faculty and other administrators, the Ethnic Studies Library opened its doors to the public.</p>"
  },
  {
    "number": 6,
    "thumbnail": "https://d1b7k5w7yjwpfg.cloudfront.net/iiif/2/bibliopolitica_CSL00022_CSL00022_001/full/800,/0/default.jpg",
    "title": "Impact & Future…",
    "content": "<p>The Ethnic Studies Library depends on its history of student activism, its innovative publishing projects, and support born from the Third World Liberation Front Strike. The Ethnic Studies Library is supported by a department that has not forgotten its student activism roots and that its history needs to be archived and accessible for the future.</p><p>For 50 years, the Chicano Studies Library has been a home for knowledge, activism and community. With the sales of books, microfilmed newspapers and Chicano Database royalties, the Chicano Studies Library, and now the Ethnic Studies Library, have remained somewhat self-sufficient. The library’s autonomy and roots in community allowed it to thrive and to achieve many ambitious projects through the power of collective action.</p><p>While the library initially cultivated collections, services and programs to meet the needs of local communities, its reach is much wider. Visiting scholars from around the world have traveled to study its unique collections. Authors acknowledge that their research would have been impossible without the Chicano Studies Collection or support of Chicano Studies Library staff. The Chicano Studies Librarians on staff have been recognized nationally for their contributions to the fields of librarianship and Chicano Studies. Perhaps above all this, the greatest achievement of the library is in the work that it has done since the beginning, the sacred work of collecting, sharing and celebrating Chicanx stories for all to see. The library does this work with the goal to give back: to give back to the students who risked their lives and their academic careers to create something of their own. The students who were part of the Third World Liberation Front Strikes could only achieve what they did because they were united. In that spirit, the Ethnic Studies Library continues this work.</p>"
  }
]