[
  {
    "ID": "OH001",
    "Label": "Lillian Castillo-Speed Oral History Interview",
    "Personal Name": [
      "Castillo-Speed, Lillian",
      "Belantara, Amanda",
      "Drabinski, Emily"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2022",
    "Short Role": "Former Chicano Studies Library Coordinator and now head of the Ethnic Studies at the University of California, Berkeley",
    "Summary": "Lillian Castillo-Speed is the former Chicano Studies Library Coordinator and now head of the Ethnic Studies at the University of California, Berkeley. She discusses her career and describes her role in the development of the Chicano Thesaurus, the Chicano Periodical Index, and the Chicano Classification System used in the Chicano Studies Collection. She describes working with colleagues including Francisco García-Ayvens and Richard Chabrán. She also discusses the transformative impact of technologies including CD-ROMs, networked computers, and relational databases, and the importance of representative subject description in libraries. Castillo-Speed also reflects on the relationship between Chicano political movements and the development and maintenance of the Thesaurus.",
    "Long Bio": "Lillian Castillo-Speed received a Master’s degree from the School of Library and Information Studies at the University of California, Berkeley in 1983. She was the Coordinator of the Chicano Studies Library at UC Berkeley from 1984 until 1997. Currently the Head Librarian of the Ethnic Studies Library, she is the Database Manager of the Chicano Database. In 1996 she received the REFORMA Librarian of the Year Award and in 2012 she received the Distinguished Librarian Award from the Librarians Association of the University of California-Berkeley Division.",
    "Notes": [
      "Interviewed remotely by Amanda Belantara and Emily Drabinski on June 10, 2022",
      "Originally recorded as part of the Ways of Knowing Oral History Project"
    ],
    "Topic": [
      "Castillo-Speed, Lillian",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Chicano thesaurus",
      "Library administration",
      "Knowledge organization"
    ],
    "Topic Verbose": "Castillo-Speed, Lillian|University of California, Berkeley. Chicano Studies Library|Chicano movement|Chicano thesaurus|Library administration|Knowledge organization",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "1 hr., 06 min., 42 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_569qjjr2"
  },
  {
    "ID": "OH002",
    "Label": "Richard Chabrán Oral History Interview",
    "Personal Name": [
      "Chabrán, Richard",
      "Belantara, Amanda",
      "Drabinski, Emily"
    ],
    "Place of Recording": "Whittier, California",
    "Date of Recording": "2022",
    "Short Role": "Former Chicano Studies Library Coordinator",
    "Summary": "Richard Chabrán is the former Chicano Studies Library Coordinator. He discusses his career and his role in the development of the Chicano Periodical Index, the Chicano Thesaurus, and working with colleagues including Lillian Castillo-Speed and Francisco García-Ayvens. He discusses the political context out of which the Chicano Thesaurus emerged, the relationship between descriptive language and collection development, information retrieval, and knowledge formation, and recounts the initial work involved in producing the Thesaurus and the Chicano Periodical Index. Chabrán also reflects on the role of the library in the broader Chicano movement.",
    "Long Bio": "Richard Chabran served as the Coordinator for the Chicano collections at UC Berkeley and UCLA. He was the founder and Director of the Center for Virtual Research at the University of California, Riverside where he developed the Community Digital Initiative. For twenty years he taught graduate students in the University of Arizona’s School of Information where he played a leading role in the Knowledge River program. He served for many years as a public advocate for addressing the digital divide.",
    "Notes": [
      "Interviewed remotely by Amanda Belantara and Emily Drabinski on June 1, 2022",
      "Originally recorded as part of the Ways of Knowing Oral History Project"
    ],
    "Topic": [
      "Chabrán, Richard",
      "University of California, Berkeley. Chicano Studies Library",
      "Knowledge organization",
      "Library administration",
      "Chicano movement"
    ],
    "Topic Verbose": "Chabrán, Richard|University of California, Berkeley. Chicano Studies Library|Knowledge organization|Library administration|Chicano movement",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "1 hr., 12 min., 08 sec",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_wr9xz7h6"
  },
  {
    "ID": "OH003",
    "Label": "Carlos Muñoz Jr. Oral History Interview",
    "Personal Name": [
      "Muñoz, Carlos, Jr.",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2023",
    "Short Role": "Scholar, author, activist, and former chair of the Chicano Studies Program at U.C. Berkeley",
    "Summary": "Dr. Carlos Muñoz Jr. is a scholar, author, activist, and former chair of the Chicano Studies Program at U.C. Berkeley. He discusses his youth and how he became an activist as a college student in Los Angeles after serving in the military. He describes his time as a professor and department chair at U.C. Berkeley, and his work supporting the growth and professionalization of the Chicano Studies library in support of the library workers, collection, and curriculum. He discusses the library as a location for student community and activism, and discusses the meaning of having his archival collection housed in the library as a resource for other scholars. He also describes meeting his future wife, Chela Rios-Muñoz, at the library.",
    "Long Bio": "Dr. Carlos Muñoz, Jr. is a Professor Emeritus in the department of Ethnic Studies at the University of California, Berkeley. He is one of the founders of Chicano and Chicana Studies . His numerous publications have contributed to a critical understanding of the history and politics of people of color in the United States. ",
    "Notes": [
      "Interviewed by Amanda Belantara with Lillian Castillo-Speed and Richard Chabrán, at U.C. Berkeley, California, on September 15, 2023"
    ],
    "Topic": [
      "Muñoz, Carlos, Jr.",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano studies",
      "Chicano movement",
      "University of California, Berkeley. Chicano Studies Program",
      "Rios-Muñoz, Chela",
      "Library administration"
    ],
    "Topic Verbose": "Muñoz, Carlos, Jr.|University of California, Berkeley. Chicano Studies Library|Chicano studies|Chicano movement|University of California, Berkeley. Chicano Studies Program|Rios-Muñoz, Chela|Library administration",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "13 min., 02 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_obm8k8ky"
  },
  {
    "ID": "OH004",
    "Label": "Chela Rios-Muñoz Oral History Interview",
    "Personal Name": [
      "Rios-Muñoz, Chela",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2023",
    "Short Role": "Clinical social worker and former staff member at the Chicano Studies Library",
    "Summary": "Chela Rios-Muñoz is a clinical social worker and former staff member at the Chicano Studies Library. She describes her time as a student at U.C. Berkeley, and her work-study placement in the Chicano Studies Library. She discusses what the library meant to her as a student at the University, as a place of representation, community, activism, safety and ideas. She discusses her work at the library and her relationships with other staff including José Arce, Richard Chabrán, Purita Mesa, and Elva Yañez. She describes her role in compiling the Bibliography of Writings on La Mujer, including punch card cataloging technology. She also describes her work with the activist group Mujeres del Movimiento, and planning the Educación en Luz Symposium. She also describes meeting her future husband, Carlos Muñoz Jr., at the library.",
    "Long Bio": "Graciela ‘Chela’ Ríos-Muñoz, LCSW the proud daughter of Mexican immigrants. She is an Emeritus Director of the Center of Excellence for Immigrant Child Health and Well Being at UCSF Benioff Children’s Hospital, and retired Clinical Coordinator of the Neonatal Follow Up Program. ",
    "Notes": [
      "Interviewed by Amanda Belantara, at U.C. Berkeley, California, on September 15, 2023"
    ],
    "Topic": [
      "Rios-Muñoz, Chela",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Mujeres del Movimiento (Berkeley, Calif.)",
      "Arce, José Antonio",
      "Chicanas",
      "Muñoz, Carlos, Jr."
    ],
    "Topic Verbose": "Rios-Muñoz, Chela|University of California, Berkeley. Chicano Studies Library|Chicano movement|Mujeres del Movimiento (Berkeley, Calif.)|Arce, José Antonio, 1948-2018|Chicanas|Muñoz, Carlos, Jr.",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "22 min., 55 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_0yzzv0lt"
  },
  {
    "ID": "OH005",
    "Label": "Clementina Duron Oral History Interview",
    "Personal Name": [
      "Duron, Clementina",
      "Castillo-Speed, Lillian",
      "Chabrán, Richard",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2023",
    "Short Role": "Bilingual educator and former staff member at the Chicano Studies Library at U.C. Berkeley",
    "Summary": "Clementina Duron is a bilingual educator and former staff member at the Chicano Studies Library at U.C. Berkeley. She describes her time as a student beginning in 1968 and the Third World Liberation Front student strikes. She describes her involvement in the strikes and protests, and the resulting development and naming of the new Chicano Studies program. She shares memories of working with program coordinator Oswaldo Asturias and other staff on compiling a bibliography and acquiring resources for the emerging library. She also describes how her time shaped her subsequent career as an educator after graduating from U.C. Berkeley in 1970, and revisiting the library on the 50th anniversary of the strike.",
    "Long Bio": "Born and raised in Salinas, California, Clementina Duron transferred from Hartnell Community College to U.C. Berkeley in fall of 1968.  It was with her participation in the TWLF student strike in January 1969 that Clementina found her voice and passion.  She became a public school teacher and principal for 30 years in the Bay Area.  In retirement she served as a school board member in Albany and continues to work in developing Ethnic Studies curriculum materials for elementary school students.",
    "Notes": [
      "Interviewed by Amanda Belantara with Lillian Castillo-Speed and Richard Chabrán, at U.C. Berkeley, California, on September 14, 2023"
    ],
    "Topic": [
      "Duron, Clementina",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Third World Liberation Front",
      "University of California, Berkeley. Chicano Studies Program",
      "Library administration",
      "Knowledge organization",
      "Corpi, Lucha"
    ],
    "Topic Verbose": "Duron, Clementina|University of California, Berkeley. Chicano Studies Library|Chicano movement|Third World Liberation Front|University of California, Berkeley. Chicano Studies Program|Library administration|Knowledge organization|Corpi, Lucha",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "40 min., 08 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_cqql9nnt"
  },
  {
    "ID": "OH006",
    "Label": "Larry Trujillo Oral History Interview",
    "Personal Name": [
      "Trujillo, Larry",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Cathedral City, California",
    "Date of Recording": "2023",
    "Short Role": "Scholar, activist, and former professor of Chicano Studies at U.C. Berkeley",
    "Summary": "Larry Trujillo is a scholar, activist, and former professor of Chicano Studies at U.C. Berkeley. He discusses his work as a student and later as faculty from 1975 until 1995, working with Richard Chabrán, José Arce, Lillian Castillo-Speed, Oscar Treviño and others, to develop the library's space and collections, including Chicano newspapers, journals, posters, and other materials. He reflects on how Chicano studies faculty and librarians worked together to develop the library and the department. He describes library efforts including the Chicano Periodical Index, Serials collection microfilm, and the Chicano Thesaurus and their importance for reflecting a Chicano worldview and supporting Chicano scholarship.",
    "Long Bio": "Dr. Larry Trujillo taught Chicano Studies at UC Berkeley and Community Studies at UC Santa Cruz. He  was the founder of the Chicano Latino Student Development Office at UC Berkeley, The Chicano Latino Resource Center at UC Santa Cruz and co-founder of the Center for Research on Criminal Justice. He played an active role in the development of Chicane Studies. His research and activism centers on Chicanos, criminal justice and social justice.",
    "Notes": [
      "Interviewed by Amanda Belantara at Cathedral City, California, on December 18, 2023"
    ],
    "Topic": [
      "Trujillo, Larry",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano studies",
      "Chicano movement",
      "University of California, Berkeley. Chicano Studies Program",
      "Library administration",
      "Knowledge organization",
      "Library outreach"
    ],
    "Topic Verbose": "Trujillo, Larry|University of California, Berkeley. Chicano Studies Library|Chicano studies|Chicano movement|University of California, Berkeley. Chicano Studies Program|Library administration|Knowledge organization|Library outreach",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "21 min., 23 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_757f2n2m"
  },
  {
    "ID": "OH007",
    "Label": "Lucha Corpi Oral History Interview",
    "Personal Name": [
      "Corpi, Lucha",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2023",
    "Short Role": "Writer, poet, scholar, and former coordinator of the Chicano Studies Library",
    "Summary": "Lucha Corpi is a writer, poet, scholar, and former coordinator of the Chicano Studies Library. She speaks about growing up in Veracruz, Mexico, her literature studies, and her work at U.C. Berkeley. She worked first as a secretary to Oswaldo Asturias, the coordinator of the Chicano Studies Program, who then appointed her as the first coordinator of the Chicano Studies Library in 1971. She discusses her work acquiring materials for the new library and building relationships with authors and publishers in the region. She describes the the library space in Dwinelle Hall, and the relationship of the library to the Chicano Studies curriculum and the broader campus culture and movements of the time. She also discusses her work in the library with José Arce and with Herminio Rios, both of whom continued working with the library after she graduated.",
    "Long Bio": "Lucha Corpi is a renowned Chicana poet, novelist, and children’s author born in Jáltipan, Veracruz, Mexico in 1945. She moved to the United States in 1964, eventually settling in California where she attended the University of California, Berkeley, earning her B.A. and later, her M.A. in Comparative Literature from San Francisco State University. Corpi's writing is celebrated for its rich portrayal of Chicano and Latino life in America, particularly through the lens of feminist and social justice themes.",
    "Notes": [
      "Interviewed by Amanda Belantara at U.C. Berkeley, California, on September 14, 2023"
    ],
    "Topic": [
      "Corpi, Lucha",
      "University of California, Berkeley. Chicano Studies Library",
      "University of California, Berkeley. Chicano Studies Program",
      "Library administration",
      "Library outreach",
      "Arts and literature\r\n",
      "Chicano literature",
      "Asturias, Oswaldo",
      "Arce, José Antonio",
      "Rios C., Herminio"
    ],
    "Topic Verbose": "Corpi, Lucha|University of California, Berkeley. Chicano Studies Library|University of California, Berkeley. Chicano Studies Program|Library administration|Library outreach|Arts and literature\r\n|Chicano literature|Asturias, Oswaldo|Arce, José Antonio, 1948-2018|Rios C., Herminio",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "27 min., 45 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_n2k4nkqh"
  },
  {
    "ID": "OH008",
    "Label": "Malaquías Montoya Oral History Interview",
    "Personal Name": [
      "Montoya, Malaquías",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Elmira, California",
    "Date of Recording": "2023",
    "Short Role": "Poster artist, activist, and educator",
    "Summary": "Malaquías Montoya is a poster artist, activist, and educator. He describes his childhood education and early interest in art, alongside seasonal farm work and military service. He discusses a job in silkscreening while attending junior college, and then his time at U.C. Berkeley, including his studies, his involvement in the Third World Liberation Front protests, designing posters for protests and events, teaching, and developing the Chicano Arts Center. He discusses the importance of the Chicano Studies Library among other community institutions and resources, and their relation to the Chicano movement and to his art.",
    "Long Bio": "A UC Davis Professor Emeritus, Malaquías Montoya is credited by historians as one of the founders of the social serigraphy movement in the San Francisco Bay Area in the mid-1960s. Montoya's unique visual expression is an art of protest, depicting the resistance and strength of humanity in the face of injustice and the necessity to unite behind that struggle. ",
    "Notes": [
      "Interviewed remotely by Amanda Belantara, on November 6, 2023"
    ],
    "Topic": [
      "Montoya, Malaquías",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Chicano art",
      "Third World Liberation Front",
      "Chicano art",
      "Arts and literature"
    ],
    "Topic Verbose": "Montoya, Malaquías|University of California, Berkeley. Chicano Studies Library|Chicano movement|Chicano art|Third World Liberation Front|Chicano art|Arts and literature",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "43 min., 15 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_gj4t2lzk"
  },
  {
    "ID": "OH009",
    "Label": "Purita Mesa Oral History Interview",
    "Personal Name": [
      "Mesa, Purita",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Berkeley, California",
    "Date of Recording": "2023",
    "Short Role": "Social worker and former staff member at the Chicano Studies Library",
    "Summary": "Purita Mesa is a social worker and former staff member at the Chicano Studies Library. She describes her time as a student at U.C. Berkeley and as a student worker in the library, including her work with José Arce and Elva Yañez, and the development of the Chicano Classification System. She also discusses her involvement with Mujeres del Movimiento and the Educación en Luz Symposium, and reflects on how she was inspired to pursue a career in social work.",
    "Long Bio": "Purita Mesa was born and raised in New York.  She attended UC Berkeley where she received her BA in Spanish and her Masters in Social Work.  She worked in the Chicano Studies Library and was a member of Mujeres del Movimiento.  She Currently works as a clinical supervisor at the University of California Benioff Children's Hospital in Oakland, California.",
    "Notes": [
      "Interviewed by Amanda Belantara with Lillian Castillo-Speed and Richard Chabrán, at U.C. Berkeley, California, on September 15, 2023"
    ],
    "Topic": [
      "Mesa, Purita",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Mujeres del Movimiento (Berkeley, Calif.)",
      "Library administration",
      "Chicano Classification System",
      "Knowledge organization",
      "Arce, José Antonio",
      "Yañez, Elva"
    ],
    "Topic Verbose": "Mesa, Purita|University of California, Berkeley. Chicano Studies Library|Chicano movement|Mujeres del Movimiento (Berkeley, Calif.)|Library administration|Chicano Classification System|Knowledge organization|Arce, José Antonio, 1948-2018|Yañez, Elva",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "12 min., 31 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_unjt61um"
  },
  {
    "ID": "OH010",
    "Label": "Sandra Ríos Balderrama Oral History Interview",
    "Personal Name": [
      "Balderrama, Sandra Ríos",
      "Belantara, Amanda"
    ],
    "Place of Recording": "Scottsdale, Arizona",
    "Date of Recording": "2023",
    "Short Role": "Librarian, former director of the ALA Office for Diversity, former president of REFORMA, and co-founder of the Pura Belpré Award",
    "Summary": "Sandra Ríos Balderrama is a librarian, former director of the ALA Office for Diversity, former president of REFORMA, and co-founder of the Pura Belpré Award. She discusses her time as a student at U.C. Berkeley beginning in 1976 including working as a student worker at the Chicano Studies Library, including working with Richard Chabrán, Francisco García-Ayvens, and others. She discusses the importance of the library as a gathering place and representation of Chicano and other Latin American experiences, and reflects on how it inspired her later career in librarianship.",
    "Long Bio": "At 17 years of age, a freshman at CAL, I met a library for us, by us, and about us: The Chicano Studies Library. The experience set a tone and shaped my journey of work as a librarian on a Bookmobile, in public libraries, at the American Library Association, in the co-founding of the Pura Belpré Children's Book Award and much more. I'm grateful to those that  insisted that the Chicano story, experience, and arts had a place at CAL.",
    "Notes": [
      "Interviewed remotely by Amanda Belantara with Richard Chabrán, on December 22, 2023"
    ],
    "Topic": [
      "Balderrama, Sandra Ríos",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano movement",
      "Library administration"
    ],
    "Topic Verbose": "Balderrama, Sandra Ríos|University of California, Berkeley. Chicano Studies Library|Chicano movement|Library administration",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "32 min., 15 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_17gy5hii"
  },
  {
    "ID": "OH011",
    "Label": "Elva Yañez Oral History Interview",
    "Personal Name": [
      "Yañez, Elva",
      "Belantara, Amanda",
      "Chabrán, Richard"
    ],
    "Place of Recording": "Whittier, California",
    "Date of Recording": "2024",
    "Short Role": "Environmental health and justice advocate and former staff member at the Chicano Studies Library",
    "Summary": "Elva Yañez is an environmental health and justice advocate and former staff member at the Chicano Studies Library. She speaks about her work in librarianship including her time as a student worker at the emerging Chicano Studies Library in the 1970s. She discusses working with José Arce and contrasts the Chicano Thesaurus and classification system with their Library of Congress counterparts.",
    "Long Bio": "Elva Yañez was a student worker at the Chicano Studies Library at UC Berkeley from 1972-1974. She graduated with a Masters in Library and Information Management from the University of Southern California in 1979 and worked in research libraries until 1990. Since then, Elva has worked extensively on public policy initiatives emphasizing environmental approaches to prevention and health equity outcomes.  ",
    "Notes": [
      "Interviewed by Amanda Belantara with Richard Chabrán, January 10, 2024"
    ],
    "Topic": [
      "Yañez, Elva",
      "University of California, Berkeley. Chicano Studies Library",
      "Chicano Thesaurus",
      "Arce, José Antonio",
      "Library administration",
      "Chicano Classification System"
    ],
    "Topic Verbose": "Yañez, Elva|University of California, Berkeley. Chicano Studies Library|Chicano Thesaurus|Arce, José Antonio, 1948-2018|Library administration|Chicano Classification System",
    "Type": [
      "Oral histories"
    ],
    "Format": [
      "audio file"
    ],
    "Running Time": "29 min., 18 sec.",
    "Language": [
      "English"
    ],
    "Rights Statement": "Open access",
    "Stream Id": "1_iion769n"
  }
]