[
  {
    "year": 1969,
    "notes" : [{
      "heading": "Library Founding",
      "description": "The La Raza Library was founded after funding was allocated following the Third World Liberation Front Strike. The library was initially located in a small office and later moved to 355 Dwinelle Hall."
    }] 
  },
  {
    "year": 1971,
    "notes" : [{
      "heading": "First Coordinator Appointed",
      "description": "Lucha Corpi, a work study student at the time, was appointed as the library’s first coordinator by La Raza Studies Coordinator, Oswaldo Asturias and was tasked with finding materials for the new collection. Corpi worked closely with Herminio Rios."
    }]
  },
  {
    "year": 1972,
    "notes" : [{
      "heading": "Jose Antonio Arce Joins the Library",
      "description": "Arce, a graduate student in architecture becomes Coordinator of the library"
    }]
  },
  {
    "year": 1973,
    "notes" : [{
      "heading": "Newspapers Microfilmed",
      "description": "Herminio Rios, editor of Quinto Sol, leads a project at the library to microfilm Spanish language newspapers from around the country, a choice that is instrumental to the library’s future autonomy and success."
      },
      {
        "heading": "Serials Microfilming Project",
        "description": "The library launched a new microfilming project with Bay Microfilms to microfilm Chicano Community Newspapers. Royalties from the microfilm helped fund future library activities."
    }]
  },
  {
    "year": 1974,
    "notes" : [{
      "heading": "Chicano Classification System",
      "description": "Jose Antonio Arce completes and releases the Chicano Classification System which centers a Chicanx worldview"
    }]
  },
  {
    "year": 1975,
    "notes" : [{
      "heading": "Richard Chabrán becomes Coordinator",
      "description": "Anthropology student Chabrán began working at the library in 1973 as a student worker. In 1975 he became the first full time coordinator and in 1977 is recognized administratively as a librarian"
    },
    {
      "heading": "The Chicano Studies Library Moves",
      "description": "The library in 355 Dwinelle is packed up and moves to a larger space in Wheeler Hall, room 104"
    }]
  },
  {
    "year": 1976,
    "notes" : [{
      "heading": "Asociación De Bibliotecas Chicanas",
      "description": "Chabrán spearheads ABC to connect and coordinate efforts between Latino library workers building Chicano collections across several libraries."
    },
    {
      "heading": "Publications Unit Created",
      "description": "The Chicano Studies Library undergoes a year-long process to establish a formal publications account to expand its publishing activities. The unit became the leading publisher in Chicano Reference sources."
    }]
  },
  {
    "year": 1977,
    "notes" : [{
      "heading": "Coordinator Position Formalized",
      "description": "The Chicano Studies Library’s coordinator becomes part of Berkeley campus “Librarian Series” making the role a professional librarian position with support from the Chicano Studies Program faculty"
    }]
  },
  {
    "year": 1978,
    "notes" : [{
    "heading": "Chicano Periodical Index Project Begins",
    "description": "Led by Chabrán, a group of 14 librarians organized to index and provide subject access to 18 key Chicano Periodicals"
    }]
  },
  {
    "year": 1979,
    "notes" : [{
      "heading": "Chicano Thesaurus Published",
      "description": "The first edition of the Chicano Thesaurus is published jointly by the Chicano Studies Library Publications Unit at UC Berkeley and the Colección Tloque Nahuaque of the University Library of UC Santa Barbara."
    },
    {
      "heading": "Aspectos De La Literatura Exhibit",
      "description": "The first exhibit of Chicano Literature in Berkeley’s Doe Library co-organized and curated by Chicano Studies Library staff"
    },
    {
      "heading": "Chabrán leaves the Chicano Studies Library",
      "description": "Chabrán moves to Los Angeles to work at the UCLA Chicano Studies Research Center Library"
    }]
  },
  {
    "year": 1980,
    "notes" : [{
      "heading": "Francisco García-Ayvens becomes Coordinator",
      "description": "Garcia-Ayvens, leaves UCLA to work at the Chicano Studies Library. García-Ayvens expanded the library’s publishing activities and made significant acquisitions to expand the library’s dissertation collections in both microfilm and print."
    }]
  },
  {
    "year": 1981,
    "notes" : [{
      "heading": "The Chicano Periodical Index Is Published",
      "description": "The Chicano Periodical Index, the first index to include Chicano periodicals, is published by GK Hall. "
    }]
  },
  {
    "year": 1982,
    "notes" : [{
      "heading": "Chicano Information Management Consortium of California",
      "description": "The CIMCC is organized to create a forum to enhance existing Chicano Collections through information exchange and collaboration. "
    }]
  },
  {
    "year": 1984,
    "notes" : [{
      "heading": "Biblio-Politica Published",
      "description": "The Chicano Studies Library publishes Biblio-Política Chicano Perspectives On Library Services In The United States. It remains one of the few volumes dedicated to the topic of Chicano Librarianship"
    },
    {
      "heading": "Lillian Castillo-Speed becomes Coordinator",
      "description": "Castillo-Speed had been working as the library’s temporary coordinator and applied for the Coordinator position after García-Ayvens left."
    }]
  },
  {
    "year": 1985,
    "notes" : [{
      "heading": "Arte Chicano Published",
      "description": "Arte Chicano: A Comprehensive Annotated Bibliography of Chicano Art: 1965-1981 is published. Compiled by Shifra M.Goldman and Tomás Ybarra-Frausto, this landmark publication was the first extensive bibliography of Chicano Art. "
    }]
  },
  {
    "year": 1989,
    "notes" : [{
      "heading": "Chicano Periodical Index Scope Widens",
      "description": "Recognizing the need to index various types of publications and scholarship,  the CPI project team decides to widen the index’s scope. It now includes mainstream serials, books, and articles in books.  It also expands to include the wider Latinx experience."
    }]
  },
  {
    "year": 1990,
    "notes" : [{
      "heading": "The Chicano Thesaurus",
      "description": "The Library of Congress adds the Chicano Thesaurus to its USMARC Code Lists for Relators, Sources, Description Conventions, making it easier for other libraries to use Chicano Thesaurus terms. The code “cht” was assigned to Chicano Thesaurus, to be used in subfield ≠2 of 6XX MARC subject heading fields."
    },
    {
      "heading": "The Chicano Database on CD-Rom",
      "description": "The Chicano Database is released on CD-Rom, the first ethnic studies database to be published in CD-ROM format, providing access to 36,000 citations of articles and books about the Chicano experience"
    },
    {
      "heading": "Chicano Anthology Index Published",
      "description": "Compiled By Francisco Garcia-Ayvens, it covers works from 1965 to the time of publication, enabling improved discovery for Chicano anthologies that were not previously indexed."
    }]
  },
  {
    "year": 1992,
    "notes" : [{
      "heading": "Lillian Castillo-Speed Appointed Head of the Ethnic Studies Libraries",
      "description": "Chair of Ethnic Studies, Ling Chi-Wang appoints Castillo-Speed as head of the three Ethnic Studies Libraries: the Asian American Studies Library, the Native American Studies Library and the Chicano Studies Library"
    }]
  },
  {
    "year": 1997,
    "notes" : [{
      "heading": "The Chicano Studies Collection & The Ethnic Studies Library Opens",
      "description": "The three libraries merge into one: the new Ethnic Studies Library. The Chicano Studies Library becomes the Chicano Studies Collection within the Ethnic Studies Library. "
    }]
  },
  {
    "year": 2005,
    "notes" : [{
      "heading": "The Chicano Thesaurus Update",
      "description": "Castillo-Speed begins work with UCLA colleague Yolanda Retter Vargas to update the Chicano Thesaurus, adding 65 Non-Chicano Latina/o terms and 24 LGBT terms at the time of the project’s completion in 2007."
    }]
  },
  {
    "year": 2007,
    "notes" : [{
      "heading": "The Chicano Database Added to OCLC First Search",
      "description": "The Chicano Database migrates from Research Libraries Group’s Eureka service to OCLC First Search"
    }]
  },
  {
    "year": 2012,
    "notes" : [{
      "heading": "The Chicano Database available via EBSCO",
      "description": "The Chicano Database is licensed by EBSCO, a large information services company and included over 60,000 records at the time."
    }]
  },
  {
    "year": 2024,
    "notes" : [{
      "heading": "The Chicano Studies Collection Celebrates 50 years",
      "description": "The Chicano Studies Library, now the Chicano Studies Collection, has provided access to materials that document the Chicanx experience for 50 years. Castillo-Speed maintains the Chicano Database and thesaurus in collaboration with Ethnic Studies Library staff."
    }]
  }
]

  


